{
  "dateTime": "2024-12-22T16:40:27Z",
  "url": "https://www.infowars.com/posts/german-mother-mourns-loss-of-9-year-old-son-in-christmas-market-attack",
  "title": "German Mother Mourns Loss of 9-Year-Old Son in Christmas Market Attack",
  "body": "Germany continues to reel from a terror attack committed by Taleb A., a Saudi man who was granted German citizenship, after Taleb murdered five Germans and wounded over 200 on Friday night at the Magdeburg Christmas market. Now, the mother of the youngest victim, 9-year-old André, has posted a heart-wrenching message on Facebook following the loss of her son.\n\n\"André didn't do anything to anyone -- why you, why?\" With these words, Désirée G. wrote her goodbyes to her son on Facebook. She also shared a photo of him.\n\n\"Let my little teddy bear fly around the world again,\" she begins her post. She wrote that André is now with his grandparents in heaven.\n\n\"They missed you very much, as much as we miss you here now.\" she added.\n\nTaleb A. drove a rented BMW into the crowd at full speed, killing five but also injuring another 200 people. There are still dozens fighting for their lives. So far, 41 people were seriously injured in the attack,\n\nOne woman, Anne, who was hit by the driver and knocked unconscious, told Bild newspaper: \"I woke up and thought I was in a dream.\" She still has a bloodshot eye from attack, however, her husband suffered a far worse injury to his thigh, saying that his flesh was \"literally ripped out.\" However, they were reunited when Anne regained consciousness when volunteers helped them find each other at the scene of the attack, and both expressed their happiness at being alive.\n\nNotably, German Christmas markets are already treated like fortresses, but Taleb A. found the only spot in the entire market that did not have a barrier, which was there to allow emergency vehicles and personnel to gain access to the market in the case of an emergency.\n\nThere is currently a debate raging about the man's motives, with a number on the right trying to claim Taleb A.is a secret Islamist. However, it appears from his own messages that he was furious that Germany was not granting asylum to Saudi refugees. He is on record threatening Germany and ethnic Germans with \"slaughter\" for not helping Saudi ex-Muslims.\n\nSome on the left are trying to tie him to the AfD, since he expressed support for the party in one of his posts. However, skeptics cite him saying he was a \"leftist\" in a video, that the AfD is strictly against mass immigration and granting asylum to those with a criminal record such as Taleb A., and that his multiple threats against Germans stands in complete contrast to the AfD's political platform, which seeks to block foreigners such as Taleb from entering the country entirely.\n\nRegardless of his motives, the man has a criminal history and had an open extradition request from Saudi Arabia -- yet he was still granted asylum and citizenship. In Germany, he faced a criminal complaint dating back to 2013 for threatening behavior. According to the Spiegel, Taleb A. had was found guilty in a district court in Rostock and sentenced to a fine of 90 daily rates on Sept. 4, 2013, for \"disturbing the public peace by threatening to commit criminal offenses\".\n\nIn addition, despite the German authorities at the BAMF being warned about his threatening statements against Germans by X users, no action was taken.\n\nIn short, it was a catastrophic failure in terms of migration and security policy from the German authorities. This failure has even caught the attention of Elon Musk, who shared a thread documenting the man's disturbing history in Germany and a lack of action from authorities.\n\nTaleb A. worked as a specialist in psychiatry and psychotherapy at a correctional facility in Bernberg. Shortly before the attack, he was on sick leave for several weeks.\n\nGermans have had their houses raided for calling Economic Minister Robert Habeck an \"idiot,\" and hundreds have faced prosecution for such insults. However, Taleb A. was saying just before the attack on X \"I assure you that revenge will 100 percent come soon. Even if it costs me my life.\"\n\nThere was no security response to his threats. In fact, police have been instead harassing grandmas at Christmas markets, a potential source of wasted resources that could have been put to work stopping an actual terror attack.\n\nTaleb A.is charged with five counts of murder and 205 counts of attempted murder. While Taleb A. is alive, Germans are mourning the deaths of their loved ones. Writing to her dead son André, Désirée G. ends her farewell post by writing: \"You will always live on in our hearts. I promise you that.\"",
  "classification": "Historical Terror Event",
  "location": {
    "region": "nbjhjhbf",
    "country": "kjhkjbf",
    "city": "jhbjnbv",
    "latitude": 87.99879874,
    "longitude": -6.8979874
  }
}